In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder


datafile= pd.read_csv("./datasets_lab/student1.csv")
datafile

    name  srn mark1  mark2  mark3 target  Unnamed: 6
0   ajay   11    88     99     70  <=50k         NaN
1  kiran   22    98     11     71   >50k         NaN
2  peter   33   100     23     67  <=50k         NaN
3   rama   44   Nan     23     78    >50         NaN

In [10]:
X= datafile.iloc[:,:-2]
X

    name  srn mark1  mark2  mark3
0   ajay   11    88     99     70
1  kiran   22    98     11     71
2  peter   33   100     23     67
3   rama   44   Nan     23     78

In [11]:
Y= datafile.loc[:,'target']
Y

0    <=50k
1     >50k
2    <=50k
3      >50
Name: target, dtype: object

In [12]:
Y= LabelEncoder().fit_transform(Y)
Y= pd.DataFrame(Y)
Y.head()

   0
0  0
1  2
2  0
3  1

In [13]:
numeric_features= X.select_dtypes('number')
categorical_features=X.select_dtypes('object')
categorical_features

    name mark1
0   ajay    88
1  kiran    98
2  peter   100
3   rama   Nan

In [14]:
converted_categorical_features= pd.get_dummies(categorical_features)
converted_categorical_features.shape

(4, 8)

In [15]:
converted_categorical_features

,name_ajay,name_kiran,name_peter,name_rama,mark1_100,mark1_88,mark1_98,mark1_Nan
0,True,False,False,False,False,True,False,False
1,False,True,False,False,False,False,True,False
2,False,False,True,False,True,False,False,False
3,False,False,False,True,False,False,False,True

In [18]:
from sklearn.model_selection import train_test_split
import sklearn.metrics as sm
X_train, y_train, X_test, y_test= train_test_split(X,Y,test_size=0.3)
X_train

   name  srn mark1  mark2  mark3
0  ajay   11    88     99     70
3  rama   44   Nan     23     78